```
------------------------------------------------------------------------
 

 
An execution plan has been generated and is shown below.
 
Resource actions are indicated with the following symbols:
 
  + create
 
  ~ update in-place
 
+/- create replacement and then destroy
 

 
Terraform will perform the following actions:
 

 
  # module.jenkins.aws_lb_target_group_attachment.lb will be created
 
  + resource "aws_lb_target_group_attachment" "lb" {
 
      + id               = (known after apply)
 
      + target_group_arn = (known after apply)
 
      + target_id        = "i-08a03167b6cff54ac"
 
    }
 

 
  # module.jenkins.module.lb.aws_lb_listener.frontend_https[0] will be updated in-place
 
  ~ resource "aws_lb_listener" "frontend_https" {
 
        arn               = "arn:aws:elasticloadbalancing:us-east-1:587807691409:listener/app/ci-sandbox-tf/ccce6fe9542494a8/780329c7cd3bab38"
 
        certificate_arn   = "arn:aws:acm:us-east-1:587807691409:certificate/a17e1e7a-8bc9-4eb7-afb2-e76cbf332ab8"
 
        id                = "arn:aws:elasticloadbalancing:us-east-1:587807691409:listener/app/ci-sandbox-tf/ccce6fe9542494a8/780329c7cd3bab38"
 
        load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:587807691409:loadbalancer/app/ci-sandbox-tf/ccce6fe9542494a8"
 
        port              = 443
 
        protocol          = "HTTPS"
 
        ssl_policy        = "ELBSecurityPolicy-2016-08"
 

 
      ~ default_action {
 
            order            = 1
 
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/ci2-sandbox/a85ee574a1e5ddb1" -> (known after apply)
 
            type             = "forward"
 
        }
 
    }
 

 
  # module.jenkins.module.lb.aws_lb_target_group.main[0] must be replaced
 
+/- resource "aws_lb_target_group" "main" {
 
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/ci-sandbox/774b7f79de99fde6" -> (known after apply)
 
      ~ arn_suffix                         = "targetgroup/ci-sandbox/774b7f79de99fde6" -> (known after apply)
 
        deregistration_delay               = 300
 
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/ci-sandbox/774b7f79de99fde6" -> (known after apply)
 
        lambda_multi_value_headers_enabled = false
 
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
 
        name                               = "ci-sandbox"
 
      ~ port                               = 80 -> 443 # forces replacement
 
      ~ protocol                           = "HTTP" -> "HTTPS" # forces replacement
 
        proxy_protocol_v2                  = false
 
        slow_start                         = 0
 
        tags                               = {
 
            "Environment" = "sandbox"
 
            "Name"        = "ci-sandbox"
 
            "Terraform"   = "true"
 
        }
 
        target_type                        = "instance"
 
        vpc_id                             = "vpc-0e4d22d8b2666bf6f"
 

 
      ~ health_check {
 
          ~ enabled             = true -> (known after apply)
 
          ~ healthy_threshold   = 5 -> (known after apply)
 
          ~ interval            = 30 -> (known after apply)
 
          ~ matcher             = "200" -> (known after apply)
 
          ~ path                = "/login" -> (known after apply)
 
          ~ port                = "traffic-port" -> (known after apply)
 
          ~ protocol            = "HTTPS" -> (known after apply)
 
          ~ timeout             = 5 -> (known after apply)
 
          ~ unhealthy_threshold = 2 -> (known after apply)
 
        }
 

 
      ~ stickiness {
 
          ~ cookie_duration = 86400 -> (known after apply)
 
          ~ enabled         = false -> (known after apply)
 
          ~ type            = "lb_cookie" -> (known after apply)
 
        }
 
    }
 

 
Plan: 2 to add, 1 to change, 1 to destroy.
 

 
------------------------------------------------------------------------

```